<!-- dflook/terraform-github-actions {"workspace":"link-var-files-2","backend_type":"remote","backend":"449491bc7627f14a573d500fdb27641b084c33eb20d3955b0213a5568e246fee","plan_job_ref":"Job Test Terraform cloud #335 at https://github.com/dflook/terraform-github-actions/actions/runs/15362625748","plan_hash":"917c82322358b3bfce9e13c630da2fd61be3d0345da6949084783adb9c667864","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __link-var-files-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #335](https://github.com/dflook/terraform-github-actions/actions/runs/15362625748)